---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.DirectContext3D.VertexBuffer
source: html/47044631-9e62-872d-7f1e-6b9bf87d5687.htm
---
# VertexBuffer Members

Constructs the vertex buffer with the given capacity, measured in floats.